//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************

//******************************************************************************
// [File] XCradleHotKey.uni
// [Description] Define XCradle HotKey String
// [Author] Celia Qian
// [Date] 20201123
//******************************************************************************

//------------------------------------------------------------------------------
/=#
#include "VFR.uni"

//------------------------------------------------------------------------------

#string STR_DEL_ENTER_SETUP      #language    en-US    "Press <DEL> to Setup or <F11> to Boot Menu or <F12> to PXE Boot."
                                 #language    fr-FR    "Press <DEL> to Setup or <F11> to Boot Menu or <F12> to PXE Boot."
                                 #language    zh-cht   "Press <DEL> to Setup or <F11> to Boot Menu or <F12> to PXE Boot."

//XCradle-ISU2022111772062-KH20221117-mod >>>
#string STR_ACK_ENTER_SETUP      #language    en-US    "DEL is Pressed, Going To Setup                                                             "
                                 #language    fr-FR    "DEL is Pressed, Going To Setup                                                             "
                                 #language    zh-cht   "DEL is Pressed, Going To Setup                                                             "

#string STR_ACK_BBS_POPUP        #language    en-US    "F11 is Pressed, Going To Boot Menu                                                         "
                                 #language    fr-FR    "F11 is Pressed, Going To Boot Menu                                                         "
                                 #language    zh-cht   "F11 is Pressed, Going To Boot Menu                                                         "

#string STR_ACK_F12_PRESSED      #language    en-US    "F12 is Pressed, Going to PXE Boot                                                          "
                                 #language    fr-FR    "F12 is Pressed, Going to PXE Boot                                                          "
                                 #language    zh-cht   "F12 is Pressed, Going to PXE Boot                                                          "
//XCradle-JSY20211123V001-Add-Start
#string STR_ACK_CTRL_F8_PRESSED  #language    en-US    "Ctrl+F8 is Pressed, Going To USB Boot                                                      "
                                 #language    fr-FR    "Ctrl+F8 is Pressed, Going To USB Boot                                                      "
                                 #language    zh-cht   "Ctrl+F8 is Pressed, Going To USB Boot                                                      "
//XCradle-JSY20211123V001-Add-End
//XCradle-ISU2022111772062-KH20221117-mod <<<

//******************************************************************************
//******************************************************************************
//**                                                                          **
//** Copyright(C) 2020-2021, XCradle Electronic Information Industry Co., Ltd. **
//**                                                                          **
//**                          All Rights Reserved.                            **
//**                                                                          **
//******************************************************************************
//******************************************************************************